// напишите программу, котороая принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23.
// 14 - нет
// 46 - нет
// 161 - да
// if (a% 7 == 0 && a %23 == 0)
// && - и
// if (category == "студент" || category == "pension")
// || - или
// if (!(a % 7 == 0)) - остаток деления на 7 не равен 0
// if (a % 7 != 0) - не равно 7
// if (a== 3 || 4) - если а равно 3 или 4, но это не корректно
// if (a == 3 || a==4  ) - а равняется 3 или а равняется 4 это правильная формула
// ! - Не

// Целочисленные побитовые операторы
// & - кайне редко используются
// | - кайне редко используются
// ^ - кайне редко используются 


Console.WriteLine("Hello, World!");
